print("如你所说，我昨天失控了，这一定伤害到你了，对此我深感抱歉。基于你现在的感受，你可以选择读我写的其中一封信：如果你已经不爱我了请看信A，如果你还爱我请看信B。")
message=input("please enter a or b: "+"\n\n\n")
if message=='a':
	print("信A"+'\n'+"亲爱的莹莹："+"\n"+

"和你在一起度过的半年里是我人生中最愉快的时光，我现在仍记得一开始和你约会时候紧张而憧憬的心情，我很清楚这种感情是真实的喜欢。我也很享受现在每周我们有固定的时间和共同的活动，我喜欢你在我身边时感受到的安逸和满足，我知道这种感觉是真实的幸福。我也憧憬将来我们在一起的时光，等我们住到一起，共同经营一个家，我知道这种期望是我真实的追求."+"\n"
+"在一起时快乐的时光占了大多数，但是不可避免的还是有矛盾和争吵。其实每次事后吵完我都会觉得很好笑，为什么互相喜欢的人会为了一件鸡毛蒜皮的事情伤害对方呐，这简直是最不可理解的事情了。"+"\n"
+"所以每次吵完架我总想快点让这些事过去，愚蠢的事情做过几次就已经很丢脸了，继续分析为什么这么愚蠢实在得不偿失。我本就应该包容你，但昨天这种机制失效了，那可能都是因为我的臭脾气，当我错误的认为自己没有被爱和尊重时我失控了。"+"\n"
+"事实上当你选择看这封信的时候分不分析昨天的事情都无所谓了，我只想告诉你你对我是多么的重要以及我对自己幼稚的行为的抱歉。我从来没有想要伤害你，我想对你无私的给予，我想对你付出最大的努力，我想对你说我爱你。"+"\n"
+"愚蠢的意成")
elif message=="b": 
	print("信B"+"\n"+
"亲爱的莹莹："+"\n"

"很高兴你选择了第二封信，如果你先读完这封信的话那就把第一封信也读了吧，如果你爱我的话，我希望你知道我真实的想法。"+"\n"

"以前我和家里人起争执的时候，我说“讲道理..”，然后长辈呵斥了我，你要和家里人讲道理嘛？这有些难以理解，我当时也愤愤难平，不过现在想来，一定要和你爱的人分出个孰是孰非反而是愚蠢的吧。"+"\n"

"我写这封信的本意不是讲道理，但是按照你的意愿我还是把昨天的事情简单的叙述下，你可以选择看或者不看。"+"\n"

"在这里我只说我现在的想法： 两个人在一起的意义不是为了分个是非对错，而是为了互相幸福，爱不是理性，爱是包容。 尽管如此，我不希望爱是盲目的，双方都会有情绪起伏波动的时候，但最终需要归于平静。我希望爱是有安全感的，就是不管对方提什么要求也不会轻视对方，这不是盲目包容，而是尽力的理解。")+"\n"	
	answer=input("Do you want to read my outline ?"+"\n"+"enter y to read, enter n to quit: "+"\n\n\n")
	if answer=='y':
		print("当断电一片漆黑时，我感觉这种氛围很好，我喜欢这种昏暗中平静而暧昧的感觉。"+"\n"
				+"我想在床上抱紧你，我渴望与你肉体接触，我想要这个房间充满你急促的呼吸声。"+"\n"
				+"我知道你情难自已，小小的房间充满欲望，你攻击我身体的敏感让我也欲火难耐。"+"\n"
				+"要擦枪走火了吗？"+"\n"
				+"但是！"+"\n"

				+"我想起你明天还要quiz，想起之前你抱怨两个人在一起的时候没有给学习留出足够的时间，我想起这个星期你突然对我说每天要学习6个小时。"+"\n"

				+"你是不是厌倦这样肉体的沉沦了呐？我有没有耽误你的学业？"+"\n"

				+"我们大可以让你的室友继续感到尴尬，但继续这样沉沦明天的考试和之后的作业就会让我们尴尬。"+"\n"

				+"要不还是去图书馆吧，停电了一直呆在家里也不是办法，不然之后又要怪我不让你学习了。"+"\n"

				+"我察觉到你的不快，你显然还沉醉于刚刚的欲火中，我马上安慰了你，像你这样的聪明理性的人应该很快就能明白的吧。"+"\n"

				+"在图书馆的时间很平静，我几乎已经忘记了出门前的不快。"+"\n"

				+"直到你睡前质问我，是不是你让我性欲变弱了？"+"\n"

				+"我不知道你怎么会冒出这个念头，那时候我几乎都睡着了，我只感觉莫名其妙。"+"\n"

				+"我感觉你对我的指责毫无道理，我们难道就在停电的公寓里滚一晚上床单吗？我更不理解你为什么把这件事扯到性欲，这让我感觉我的好心遭到了践踏，还有我的尊严，我感觉被你说成了一个只知道读书的性冷淡."+"\n"

				+"我失控了，因为我的好意没有得到感激，相反还受到了侮辱。"+"\n"

				+"我只想在寒风中平息自己的心情，因为我感觉我的女友根本不关心我，我想要回忆一个人孤独活着的感觉。"+"\n")

		review=input("Do you want to read letter A?"+"\n"+"enter y to read, enter n to quit: " +"\n\n\n")
		if review=="y":
			print("信A"+'\n'+"亲爱的莹莹："+"\n"+

					"和你在一起度过的半年里是我人生中最愉快的时光，我现在仍记得一开始和你约会时候紧张而憧憬的心情，我很清楚这种感情是真实的喜欢。我也很享受现在每周我们有固定的时间和共同的活动，我喜欢你在我身边时感受到的安逸和满足，我知道这种感觉是真实的幸福。我也憧憬将来我们在一起的时光，等我们住到一起，共同经营一个家，我知道这种期望是我真实的追求."+"\n"
					+"在一起时快乐的时光占了大多数，但是不可避免的还是有矛盾和争吵。其实每次事后吵完我都会觉得很好笑，为什么互相喜欢的人会为了一件鸡毛蒜皮的事情伤害对方呐，这简直是最不可理解的事情了。"+"\n"
					+"所以每次吵完架我总想快点让这些事过去，愚蠢的事情做过几次就已经很丢脸了，继续分析为什么这么愚蠢实在得不偿失。我本就应该包容你，但昨天这种机制失效了，那可能都是因为我的臭脾气，当我错误的认为自己没有被爱和尊重时我失控了。"+"\n"
					+"事实上当你选择看这封信的时候分不分析昨天的事情都无所谓了，我只想告诉你你对我是多么的重要以及我对自己幼稚的行为的抱歉。我从来没有想要伤害你，我想对你无私的给予，我想对你付出最大的努力，我想对你说我爱你。"+"\n"
					+"愚蠢的意成")
		else:
			quit;
	else:
		review=input("Yes, we need to move on"+"\n"+"Do you want to read letter A?"+"\n"+"enter y to read, enter n to quit: "+"\n\n\n")
		if review=="y":
			print("信A"+'\n'+"亲爱的莹莹："+"\n"+

					"和你在一起度过的半年里是我人生中最愉快的时光，我现在仍记得一开始和你约会时候紧张而憧憬的心情，我很清楚这种感情是真实的喜欢。我也很享受现在每周我们有固定的时间和共同的活动，我喜欢你在我身边时感受到的安逸和满足，我知道这种感觉是真实的幸福。我也憧憬将来我们在一起的时光，等我们住到一起，共同经营一个家，我知道这种期望是我真实的追求."+"\n"
					+"在一起时快乐的时光占了大多数，但是不可避免的还是有矛盾和争吵。其实每次事后吵完我都会觉得很好笑，为什么互相喜欢的人会为了一件鸡毛蒜皮的事情伤害对方呐，这简直是最不可理解的事情了。"+"\n"
					+"所以每次吵完架我总想快点让这些事过去，愚蠢的事情做过几次就已经很丢脸了，继续分析为什么这么愚蠢实在得不偿失。我本就应该包容你，但昨天这种机制失效了，那可能都是因为我的臭脾气，当我错误的认为自己没有被爱和尊重时我失控了。"+"\n"
					+"事实上当你选择看这封信的时候分不分析昨天的事情都无所谓了，我只想告诉你你对我是多么的重要以及我对自己幼稚的行为的抱歉。我从来没有想要伤害你，我想对你无私的给予，我想对你付出最大的努力，我想对你说我爱你。"+"\n"
					+"愚蠢的意成")
		else:
			quit;
else:
	print("you should only enter a or b")
	
